In [1]:
import sqlalchemy

%load_ext sql
%sql oracle://scott:tiger@localhost:1521/orcl

# ORDER BY
" order by절은 데이터를 정렬하는 절이고 select 문장에 맨 마지막에 기술함 "  
예:  
select ename, sal  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;from emp  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;order by sal asc;  
  
- sal: 정렬할 컬럼명
- asc: 정렬 방법( asc: 낮은 값으로부터 높은 값순으로 / desc: 높은 값으로부터 낮은 값 순으로 )

※ order by 절에는 컬럼을 여러개를 작성할 수 있다.  

select ename<<1>>, deptno<<2>>, sal<<3>>  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; from emp  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; order by <<2>> asc, <<3>> desc  

-> deptno가 먼저 정렬이 되고 그것들이 그룹화 되어 그룹한 채로 sal이 정렬이 됌

In [2]:
%%sql
select ename, deptno, sal
    from emp
    order by deptno asc, sal desc

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('KING', 10, Decimal('5000')),
 ('CLARK', 10, Decimal('2450')),
 ('MILLER', 10, Decimal('1300')),
 ('SCOTT', 20, Decimal('3000')),
 ('FORD', 20, Decimal('3000')),
 ('JONES', 20, Decimal('2975')),
 ('ADAMS', 20, Decimal('1100')),
 ('SMITH', 20, Decimal('800')),
 ('BLAKE', 30, Decimal('2850')),
 ('ALLEN', 30, Decimal('1600')),
 ('TURNER', 30, Decimal('1500')),
 ('MARTIN', 30, Decimal('1250')),
 ('WARD', 30, Decimal('1250')),
 ('JAMES', 30, Decimal('950'))]

문제 13. 이름과 월급을 출력하는데 월급이 높은 사원부터 출력하시오!

In [3]:
%%sql

select ename, sal
    from emp
    order by sal desc

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('KING', Decimal('5000')),
 ('SCOTT', Decimal('3000')),
 ('FORD', Decimal('3000')),
 ('JONES', Decimal('2975')),
 ('BLAKE', Decimal('2850')),
 ('CLARK', Decimal('2450')),
 ('ALLEN', Decimal('1600')),
 ('TURNER', Decimal('1500')),
 ('MILLER', Decimal('1300')),
 ('WARD', Decimal('1250')),
 ('MARTIN', Decimal('1250')),
 ('ADAMS', Decimal('1100')),
 ('JAMES', Decimal('950')),
 ('SMITH', Decimal('800'))]

문제 14. 이름과 입사일을 출력하는데 최근에 입사한 사원부터 출력하시오

In [4]:
%%sql

select ename, hiredate
    from emp
    order by hiredate desc

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('ADAMS', datetime.datetime(1983, 1, 15, 0, 0)),
 ('SCOTT', datetime.datetime(1982, 12, 22, 0, 0)),
 ('MILLER', datetime.datetime(1982, 1, 11, 0, 0)),
 ('FORD', datetime.datetime(1981, 12, 11, 0, 0)),
 ('JAMES', datetime.datetime(1981, 12, 11, 0, 0)),
 ('KING', datetime.datetime(1981, 11, 17, 0, 0)),
 ('MARTIN', datetime.datetime(1981, 9, 10, 0, 0)),
 ('TURNER', datetime.datetime(1981, 8, 21, 0, 0)),
 ('CLARK', datetime.datetime(1981, 5, 9, 0, 0)),
 ('BLAKE', datetime.datetime(1981, 5, 1, 0, 0)),
 ('JONES', datetime.datetime(1981, 4, 1, 0, 0)),
 ('WARD', datetime.datetime(1981, 2, 23, 0, 0)),
 ('ALLEN', datetime.datetime(1981, 2, 11, 0, 0)),
 ('SMITH', datetime.datetime(1980, 12, 9, 0, 0))]

문제 15. 이름과 월급과 부서번호를 출력하는데 부서번호가 10번, 20번, 30번 순으로 출력되게 하고 컬럼명이 한글로 이름, 월급, 부서번호로 출력되게 하시오

In [5]:
%%sql
select ename "이름", sal "월급", deptno "부서번호"
    from emp
    order by deptno asc

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('KING', Decimal('5000'), 10),
 ('CLARK', Decimal('2450'), 10),
 ('MILLER', Decimal('1300'), 10),
 ('ADAMS', Decimal('1100'), 20),
 ('SCOTT', Decimal('3000'), 20),
 ('SMITH', Decimal('800'), 20),
 ('FORD', Decimal('3000'), 20),
 ('JONES', Decimal('2975'), 20),
 ('WARD', Decimal('1250'), 30),
 ('JAMES', Decimal('950'), 30),
 ('ALLEN', Decimal('1600'), 30),
 ('MARTIN', Decimal('1250'), 30),
 ('BLAKE', Decimal('2850'), 30),
 ('TURNER', Decimal('1500'), 30)]

문제 15. 이름과 직업과 입사일을 출력하는데 직업은 ABCD 순으로 정렬해서 출력하고  
           직업을 ABCD 순으로 정렬한 걸 기준으로 입사일을 먼저 입사한 사원부터 출력되게 하시오

In [6]:
%%sql

select ename, job, hiredate
    from emp
    order by job asc, hiredate desc

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('SCOTT', 'ANALYST', datetime.datetime(1982, 12, 22, 0, 0)),
 ('FORD', 'ANALYST', datetime.datetime(1981, 12, 11, 0, 0)),
 ('ADAMS', 'CLERK', datetime.datetime(1983, 1, 15, 0, 0)),
 ('MILLER', 'CLERK', datetime.datetime(1982, 1, 11, 0, 0)),
 ('JAMES', 'CLERK', datetime.datetime(1981, 12, 11, 0, 0)),
 ('SMITH', 'CLERK', datetime.datetime(1980, 12, 9, 0, 0)),
 ('CLARK', 'MANAGER', datetime.datetime(1981, 5, 9, 0, 0)),
 ('BLAKE', 'MANAGER', datetime.datetime(1981, 5, 1, 0, 0)),
 ('JONES', 'MANAGER', datetime.datetime(1981, 4, 1, 0, 0)),
 ('KING', 'PRESIDENT', datetime.datetime(1981, 11, 17, 0, 0)),
 ('MARTIN', 'SALESMAN', datetime.datetime(1981, 9, 10, 0, 0)),
 ('TURNER', 'SALESMAN', datetime.datetime(1981, 8, 21, 0, 0)),
 ('WARD', 'SALESMAN', datetime.datetime(1981, 2, 23, 0, 0)),
 ('ALLEN', 'SALESMAN', datetime.datetime(1981, 2, 11, 0, 0))]